{
  "backend/main.mo": "Defines actor with content types, user profiles, versioned draft/published content, access control, storage mixins, and publishing/ownership logic.",
  "backend/migration.mo": "Provides migration logic converting the old actor’s stable fields to the new structure including versionPublishData.",
  "feature_evidence.json": "Lists feature evidence entries linking specific frontend files to feature requirements and components.",
  "frontend-file-summaries.txt": "Contains pre-written summaries for multiple frontend files describing their purpose and functionality.",
  "frontend/index.css": "Tailwind base styles and OKLCH color variables for light/dark themes with global component styling.",
  "frontend/index.html": "Basic HTML entry point that loads the React application via main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and initializes active content version from URL on first load.",
  "frontend/src/components/ContentVersionSwitcher.tsx": "UI component for switching content versions, invalidating/refetching version-scoped queries, and handling custom version input.",
  "frontend/src/components/DraftReviewSummary.tsx": "Displays draft gallery and message counts with loading states and last-loaded timestamp.",
  "frontend/src/components/DragReorderList.tsx": "Provides draggable list UI that reorders items locally during drag and commits on drag end.",
  "frontend/src/components/EditGuard.tsx": "Gates editing behind authentication and profile setup, showing login or loading states when needed.",
  "frontend/src/components/editors/DedicationEditor.tsx": "Editor for updating the final dedication text, syncing with draft data and saving changes.",
  "frontend/src/components/editors/GalleryEditor.tsx": "React component for managing draft gallery items, supporting image upload, caption input, deletion, and drag-and-drop reordering. Uses mutation hooks to sync changes to the backend.",
  "frontend/src/components/editors/InteractiveSurpriseEditor.tsx": "Editor for configuring interactive surprises, allowing creation and modification of quiz questions and flip cards. Saves the combined config via a backend mutation.",
  "frontend/src/components/editors/LoveMessagesEditor.tsx": "Tool for adding, editing, deleting, and reordering love messages with titles, previews, and full text. Synchronizes updates through dedicated mutation hooks.",
  "frontend/src/components/editors/TimelineEditor.tsx": "Editor for timeline milestones, supporting date, title, description, optional photo upload, and item reordering. Persists changes through timeline mutation hooks.",
  "frontend/src/components/FlipCard.tsx": "A flip‑animation card that toggles between front and back text on click.",
  "frontend/src/components/GalleryCarousel.tsx": "Image carousel with navigation, error handling, and thumbnail selection for gallery items.",
  "frontend/src/components/GoLiveGuidance.tsx": "Shows publishing steps and status, including share link info for the active content version.",
  "frontend/src/components/HeartParticles.tsx": "Generates animated floating heart particles for decorative background effects.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button wired to Internet Identity with loading and error-recovery handling.",
  "frontend/src/components/LoveQuiz.tsx": "Interactive quiz component with scoring, answer feedback, and restart functionality.",
  "frontend/src/components/MessageEnvelopeCard.tsx": "Displays a message preview as an envelope card and shows the full message in a modal when opened.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal that collects and saves the user's name before continuing into the app.",
  "frontend/src/components/PublishControls.tsx": "Provides UI to publish the current draft, view publish status, copy share links, and handle related success or error states.",
  "frontend/src/components/PublishingCallout.tsx": "Alert banner explaining that edits are drafts until the user publishes the site.",
  "frontend/src/components/SiteLayout.tsx": "Wraps pages with site-wide layout, background, navigation, and footer content.",
  "frontend/src/components/SiteNav.tsx": "Top navigation bar with links, mobile menu handling, and login button.",
  "frontend/src/components/SurpriseReveal.tsx": "Interactive button that reveals a surprise message once clicked.",
  "frontend/src/components/TimelineMilestoneItem.tsx": "Renders a timeline milestone with expandable details and optional photo handling.",
  "frontend/src/components/ValentineSurface.tsx": "Simple styled container component for consistent card-like surfaces.",
  "frontend/src/hooks/useActor.ts": "React hook that initializes and caches a backend actor tied to the user's identity, invalidating dependent queries on change. Supports optional admin token setup.",
  "frontend/src/hooks/useContentVersion.ts": "Zustand store for tracking the active content version with persistence and URL-based initialization. Provides hook access for reading and updating the version.",
  "frontend/src/hooks/useEditMutations.ts": "Collection of React Query mutation hooks for editing gallery items, love messages, interactive surprises, and related content. Each mutation updates backend state and refreshes draft content queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity login, managing identity state and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, content versions, and draft content from the backend.",
  "frontend/src/index.css": "Tailwind CSS setup with custom pastel-themed variables, dark mode styles, and animation utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider, rendering the root App component.",
  "frontend/src/pages/EditContentPage.tsx": "Renders the content editing interface with tabs, version switching, publishing controls, and draft content editors.",
  "frontend/src/pages/FinalDedicationPage.tsx": "Displays the published final dedication with loading, error, and unpublished states handled.",
  "frontend/src/pages/HomePage.tsx": "Shows the homepage with a hero banner, particles, and quick navigation links to site sections.",
  "frontend/src/pages/InteractiveSurprisePage.tsx": "Displays an interactive surprise page that loads published quiz and flip‑card content, handling loading, error, and empty states.",
  "frontend/src/pages/LoveMessagesPage.tsx": "Fetches and displays ordered love messages in envelope cards with loading, error, and unpublished-content handling.",
  "frontend/src/pages/MemoriesGalleryPage.tsx": "Shows a sorted gallery of published memory items via a carousel, with support for loading, errors, and missing content.",
  "frontend/src/pages/TimelinePage.tsx": "Renders a chronological timeline of published milestones with alternating layout and handles loading, errors, and empty states.",
  "frontend/src/utils/authzError.ts": "Provides helpers to detect authorization-related errors and return user-friendly messages for various backend error patterns.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, storing, and clearing URL parameters with session persistence and hash‑routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending fonts, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project metadata, existing features, and pending feature requests for the app’s versioning and guidance improvements."
}