{
  "backend/main.mo": "Motoko canister managing user profiles, gallery items, love messages, timeline milestones, surprise config, and dedication with access control and blob storage.",
  "feature_evidence.json": "Machine‑generated feature report mapping project requirements to involved frontend files and components.",
  "frontend-file-summaries.txt": "List of prewritten summaries describing the purpose of all major frontend components, pages, hooks, and styles.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color tokens, dark mode variants, and global background/foreground styles.",
  "frontend/index.html": "Root HTML file loading the React app entrypoint and setting basic metadata.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for all site pages and wraps them in the shared layout.",
  "frontend/src/components/DragReorderList.tsx": "Generic drag-to-reorder list component supporting item dragging, visual feedback, and reorder callbacks.",
  "frontend/src/components/EditGuard.tsx": "Protects edit-only pages by requiring authentication and profile setup, showing login or loading states when needed.",
  "frontend/src/components/editors/DedicationEditor.tsx": "Fetches, edits, and saves the final dedication title and message using form inputs and mutation hooks.",
  "frontend/src/components/editors/GalleryEditor.tsx": "Manages gallery items with add, delete, reorder, and image upload functionality with progress tracking.",
  "frontend/src/components/editors/InteractiveSurpriseEditor.tsx": "Edits interactive surprise config by adding, modifying, and validating quiz questions and flip cards, then saving via mutation.",
  "frontend/src/components/editors/LoveMessagesEditor.tsx": "Handles creation, editing, deletion, and reordering of love messages with form fields and mutation hooks.",
  "frontend/src/components/editors/TimelineEditor.tsx": "Allows adding, deleting, and reordering timeline milestones with date, text fields, and optional photo upload.",
  "frontend/src/components/FlipCard.tsx": "Interactive flip-card component showing front/back content using 3D rotation animation.",
  "frontend/src/components/GalleryCarousel.tsx": "Image carousel with navigation, captions, and clickable thumbnails.",
  "frontend/src/components/HeartParticles.tsx": "Generates floating animated heart particles positioned randomly.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button using Internet Identity with loading and error handling.",
  "frontend/src/components/LoveQuiz.tsx": "Interactive quiz component with scoring, answer feedback, and restart flow.",
  "frontend/src/components/MessageEnvelopeCard.tsx": "Expandable card showing a message preview and full message modal on open.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting the user for their name and saving the profile.",
  "frontend/src/components/SiteLayout.tsx": "App layout with background pattern, navigation, content slot, and footer.",
  "frontend/src/components/SiteNav.tsx": "Responsive navigation bar with links, active highlighting, login button, and mobile menu.",
  "frontend/src/components/SurpriseReveal.tsx": "Button that reveals a surprise message with animated icons when clicked.",
  "frontend/src/components/TimelineMilestoneItem.tsx": "Displays a timeline milestone with expandable details and an optional photo, alternating layout based on index.",
  "frontend/src/components/ValentineSurface.tsx": "Wraps children in a styled card-like container with optional extra class names.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on user identity, reinitializing access control and invalidating dependent queries on change.",
  "frontend/src/hooks/useEditMutations.ts": "Provides React Query mutation hooks for creating, updating, reordering, and deleting gallery items, love messages, timeline milestones, surprises, and dedications using an actor API.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider with login, logout, identity loading, and status management using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and saving user profiles, gallery items, messages, timeline milestones, surprise configs, and final dedications via an actor API.",
  "frontend/src/index.css": "Configures Tailwind layers, theme variables, dark mode values, global styles, and custom animation utilities for the app’s romantic design.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/EditContentPage.tsx": "Renders a protected tabbed interface for editing gallery items, messages, timeline entries, dedications, and surprise content.",
  "frontend/src/pages/FinalDedicationPage.tsx": "Displays the final dedication content with loading state, styled layout, and fallback when no dedication is available.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage with a hero section, animations, divider, and quick link cards to major site sections.",
  "frontend/src/pages/InteractiveSurprisePage.tsx": "Loads interactive surprise config and displays reveal, quiz, and flip-card activities with animations and heart effects.",
  "frontend/src/pages/LoveMessagesPage.tsx": "Fetches and sorts love messages, showing them as envelope cards or an empty state if none exist.",
  "frontend/src/pages/MemoriesGalleryPage.tsx": "Retrieves and sorts gallery items, displaying them in a carousel or an empty prompt when no photos are available.",
  "frontend/src/pages/TimelinePage.tsx": "Loads and sorts timeline milestones, rendering an animated vertical timeline with milestone items or an empty message.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session-based parameters, including hash routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, fonts, colors, animations, and plugins for the romantic design system.",
  "project_state.json": "Project metadata describing versions, features, image requirements, and existing Valentine-themed functionality."
}