{
  "backend/main.mo": "Motoko canister managing gallery items, messages, timeline data, user profiles, and interactive content with access control and blob storage.",
  "feature_evidence.json": "Feature evidence report linking edit‑content functionality to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing multiple frontend files’ purposes, styling, routing, components, and hooks.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color tokens, theming variables, and light/dark mode overrides.",
  "frontend/index.html": "Basic HTML entry point mounting the root div and loading the React app.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all main site routes wrapped in the shared layout.",
  "frontend/src/components/DraftReviewSummary.tsx": "Dashboard-style summary showing gallery and message counts with loading states and last-loaded timestamp.",
  "frontend/src/components/DragReorderList.tsx": "Generic drag‑and‑drop list component that updates order locally and commits changes on drag end.",
  "frontend/src/components/EditGuard.tsx": "Edit access wrapper enforcing Internet Identity login and profile setup before showing children.",
  "frontend/src/components/editors/DedicationEditor.tsx": "Editor for viewing and updating the final dedication title and message with validation and save handling.",
  "frontend/src/components/editors/GalleryEditor.tsx": "Manages gallery items including upload, captioning, deletion, and drag-and-drop reordering.",
  "frontend/src/components/editors/InteractiveSurpriseEditor.tsx": "Editor for configuring quiz questions and flip cards with full CRUD and validation before saving.",
  "frontend/src/components/editors/LoveMessagesEditor.tsx": "Handles adding, editing, deleting, and reordering love messages with form controls and mutations.",
  "frontend/src/components/editors/TimelineEditor.tsx": "Editor for creating, deleting, and reordering timeline milestones including date input and optional photo upload.",
  "frontend/src/components/FlipCard.tsx": "3D flip card component toggling between front and back content with rotation animation.",
  "frontend/src/components/GalleryCarousel.tsx": "Image carousel with next/previous controls, captions, and selectable thumbnails.",
  "frontend/src/components/HeartParticles.tsx": "Generates floating animated heart particles positioned randomly on the screen.",
  "frontend/src/components/LoginButton.tsx": "Handles Internet Identity login/logout states and displays a status-aware auth button.",
  "frontend/src/components/LoveQuiz.tsx": "Interactive quiz component with scoring, answer validation, and a results screen.",
  "frontend/src/components/MessageEnvelopeCard.tsx": "Expandable card that opens a modal to display a full love message with title and content.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting the user for their name and saving the profile via a mutation.",
  "frontend/src/components/PublishingCallout.tsx": "Callout explaining how to publish the site and provides a copy-to-clipboard helper message.",
  "frontend/src/components/SiteLayout.tsx": "Top-level layout including background pattern, navigation, main content, and footer attribution.",
  "frontend/src/components/SiteNav.tsx": "Responsive navigation bar with links, icons, mobile menu, and login button integration.",
  "frontend/src/components/SurpriseReveal.tsx": "Component that toggles between a surprise button and a revealed message with animations.",
  "frontend/src/components/TimelineMilestoneItem.tsx": "Displays a timeline milestone with expandable details and optional photo, formatted by alternating layout.",
  "frontend/src/components/ValentineSurface.tsx": "Reusable styled container component that wraps children with card-like styling.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity, reinitializing it on identity change and invalidating dependent queries.",
  "frontend/src/hooks/useEditMutations.ts": "Provides React Query mutations for editing gallery items, love messages, and other content via the backend actor, with cache invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, exposing identity, login, logout, and status through a React context provider.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks to fetch user profile and all editable content types through the backend actor.",
  "frontend/src/index.css": "Tailwind setup with custom color variables, animations, and themed utility classes for the app’s styling.",
  "frontend/src/main.tsx": "Initializes React, sets up QueryClient and InternetIdentityProvider, and renders the main app.",
  "frontend/src/pages/EditContentPage.tsx": "Admin page with tabbed editors for gallery, messages, timeline, dedication, and surprise content, wrapped in edit permissions.",
  "frontend/src/pages/FinalDedicationPage.tsx": "Displays the final dedication message with loading state and styled presentation.",
  "frontend/src/pages/HomePage.tsx": "Renders the main landing page with a hero section, background image, heart particles, and a grid of navigation cards.",
  "frontend/src/pages/InteractiveSurprisePage.tsx": "Displays interactive surprises including a reveal, quiz, and flip cards loaded from configuration.",
  "frontend/src/pages/LoveMessagesPage.tsx": "Fetches and displays sorted love messages in a grid, showing loading and empty states.",
  "frontend/src/pages/MemoriesGalleryPage.tsx": "Loads and displays a sorted gallery of memory items with a carousel and fallback empty state.",
  "frontend/src/pages/TimelinePage.tsx": "Shows a chronological list of timeline milestones with a vertical timeline layout and loading/empty handling.",
  "frontend/src/utils/authzError.ts": "Parses authorization-related errors and provides user-friendly error messages based on common patterns.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query strings and session storage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending themes, colors, fonts, animations, and enabling plugins.",
  "project_state.json": "Describes the project state, feature requests, and metadata for the editing-permissions feature work."
}