{
  "backend/main.mo": "Motoko canister defining types and CRUD APIs for gallery, messages, timeline, surprises, dedication, and user profiles with access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping two publishing‑related features to affected frontend files and components.",
  "frontend-file-summaries.txt": "JSON mapping of many frontend file paths to short descriptive summaries for build reference.",
  "frontend/index.css": "Tailwind base/theme variable definitions for light and dark modes using OKLCH color tokens.",
  "frontend/index.html": "HTML root document loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all site routes wrapped in SiteLayout.",
  "frontend/src/components/DraftReviewSummary.tsx": "Shows counts of draft gallery items and messages plus last-loaded time using query hooks.",
  "frontend/src/components/DragReorderList.tsx": "Generic drag-and-drop reorderable list component that updates order on drag end.",
  "frontend/src/components/EditGuard.tsx": "Protects edit pages by requiring login and user profile setup before rendering children.",
  "frontend/src/components/editors/DedicationEditor.tsx": "Editor for viewing and updating the final dedication title and message with save validation and mutation calls.",
  "frontend/src/components/editors/GalleryEditor.tsx": "Editor for adding, deleting, and reordering gallery photos with caption input and file upload support.",
  "frontend/src/components/editors/InteractiveSurpriseEditor.tsx": "Editor for managing interactive surprise config, including quiz questions and flip cards with validation and saving.",
  "frontend/src/components/editors/LoveMessagesEditor.tsx": "Editor to add, edit, delete, and reorder love messages with support for previews and full text.",
  "frontend/src/components/editors/TimelineEditor.tsx": "Editor for creating, deleting, and reordering timeline milestones with date, text, and optional photo upload.",
  "frontend/src/components/FlipCard.tsx": "Interactive flip card with 3D front/back rotation on click.",
  "frontend/src/components/GalleryCarousel.tsx": "Image carousel with navigation buttons and thumbnail selectors.",
  "frontend/src/components/HeartParticles.tsx": "Renders floating animated heart particles positioned randomly.",
  "frontend/src/components/LoginButton.tsx": "Handles Internet Identity login/logout with loading states and UI feedback.",
  "frontend/src/components/LoveQuiz.tsx": "Interactive multi‑question quiz with scoring, answer validation, and result display.",
  "frontend/src/components/MessageEnvelopeCard.tsx": "Expandable card that opens a modal to display a full love message.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting the user to enter and save their profile name.",
  "frontend/src/components/PublishingCallout.tsx": "Alert explaining publishing steps with a copyable preset message and fallback UI.",
  "frontend/src/components/SiteLayout.tsx": "Page layout wrapper with background pattern, navigation, and footer attribution.",
  "frontend/src/components/SiteNav.tsx": "Responsive site navigation bar with links, mobile menu, and login button.",
  "frontend/src/components/SurpriseReveal.tsx": "Component that toggles between a surprise button and a revealed heartfelt message with animations.",
  "frontend/src/components/TimelineMilestoneItem.tsx": "Displays a timeline milestone with date, title, expandable details, and optional photo, supporting alternating layout.",
  "frontend/src/components/ValentineSurface.tsx": "Simple wrapper component providing a styled card-like surface around children.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useEditMutations.ts": "Provides React Query mutations for editing gallery items, love messages, timeline milestones, and related content through the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for login, logout, and identity persistence using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching user profiles, gallery items, messages, timeline data, surprises, and dedications via the actor.",
  "frontend/src/index.css": "Tailwind configuration with custom color variables, animations, and theme styles for both light and dark modes.",
  "frontend/src/main.tsx": "Entry point initializing React, React Query, and Internet Identity provider before rendering the app.",
  "frontend/src/pages/EditContentPage.tsx": "Page that wraps editors in tabs for managing gallery, messages, timeline, dedication, and surprise content with edit safeguards.",
  "frontend/src/pages/FinalDedicationPage.tsx": "Displays the final dedication content with loading state handling and styled presentation.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero section, heart animations, and quick navigation cards linking to all major site sections.",
  "frontend/src/pages/InteractiveSurprisePage.tsx": "Displays interactive surprise features including a reveal component, quiz, and flip cards driven by fetched config data.",
  "frontend/src/pages/LoveMessagesPage.tsx": "Fetches and displays sorted love messages as envelope cards, with loading and empty states.",
  "frontend/src/pages/MemoriesGalleryPage.tsx": "Loads and sorts gallery items, showing either a carousel of memories or an empty-state placeholder.",
  "frontend/src/pages/TimelinePage.tsx": "Retrieves and chronologically displays timeline milestones in a vertical timeline layout with loading and empty handling.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL parameters, including sessionStorage-based fallback.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata, requirements, known issues, and architectural notes for the Valentine-themed website."
}