{
  "kind": "build_request",
  "title": "Add in-app guidance to make a published version “live” and shareable",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-5",
      "text": "Add a clear “Go Live” guidance section in the editor experience that explains, in-app, the exact steps to make the current content version publicly visible and shareable (publish the draft, then copy/share the version-specific link).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "how to make it live"
        ]
      },
      "acceptanceCriteria": [
        "On the Edit page, users can see a short step-by-step checklist describing how to make the site live for the currently selected version.",
        "The guidance uses English user-facing text and explicitly mentions that publishing is required before visitors can see updates.",
        "The guidance references and matches the existing version-specific share link behavior (URL includes ?v=<version>)."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Improve the publishing UI to reduce confusion about whether the current version is live by showing a prominent status indicator for the active version (e.g., “Not published yet” vs “Live”) and providing a one-click action to copy the correct share link even after the success toast/alert is dismissed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "how to make it live"
        ]
      },
      "acceptanceCriteria": [
        "When viewing /edit, the user can always find the share link for the active version (not only immediately after a successful publish).",
        "The UI clearly indicates whether the active version is currently published (live) or not.",
        "Copying the link copies a URL in the form `${origin}/?v=${activeVersion}` (using the existing `buildShareUrl`)."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Update backend publish-status tracking to be version-specific so the frontend can accurately display “live” status for the currently active version, rather than a single global publish timestamp for all versions.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "how to make it live"
        ]
      },
      "acceptanceCriteria": [
        "Backend stores and returns publish status per version (at minimum: isPublished + lastPublished + draftLastUpdated for a given version).",
        "Publishing version A does not cause version B to appear published unless B was published.",
        "Existing publish workflow continues to work for current users; no auth requirements are added to public viewing endpoints."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo.",
    "Only generate backend/migration.mo if required to preserve existing stable state across upgrades (conditional migration policy).",
    "Do not edit any files under frontend/src/components/ui or any path listed in frontend.immutablePaths."
  ],
  "nonGoals": [
    "Adding external hosting/deployment providers or non-Internet-Computer deployment steps.",
    "Adding third-party authentication (only Internet Identity is allowed).",
    "Introducing real-time features (WebSockets, push notifications, etc.)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}