{
  "kind": "build_request",
  "title": "Enable editing for the deployed draft (remove admin-only restriction)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Make the deployed draft content editable for any authenticated Internet Identity user by removing the current admin-only restriction on content modification methods (gallery, love messages, timeline milestones, interactive surprise config, and final dedication). Editing access should require a logged-in identity, but must not require the caller to be an admin.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "make it editable"
        ]
      },
      "acceptanceCriteria": [
        "A logged-in Internet Identity user can successfully call add/update/delete/reorder methods for gallery items, love messages, and timeline milestones without receiving \"Unauthorized: Only admins...\" traps.",
        "A logged-in Internet Identity user can successfully call setInteractiveSurpriseConfig and setFinalDedication without receiving \"Unauthorized: Only admins...\" traps.",
        "Unauthenticated (guest) callers still cannot call any content-modification methods and receive an authorization error/trap.",
        "All existing query (read-only) methods remain publicly accessible as they are now (e.g., getAllGalleryItems, getAllLoveMessages, getAllTimelineMilestones, getInteractiveSurpriseConfig, getFinalDedication)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the existing Edit Content UI works end-to-end for authenticated users after the permission change, including successful saves and automatic list refresh via React Query invalidation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "make it editable"
        ]
      },
      "acceptanceCriteria": [
        "After logging in, the user can use the Edit Content page tabs (Gallery, Messages, Timeline, Dedication, Surprise) to make changes and save them successfully without authorization failures.",
        "After a successful create/update/delete/reorder action, the corresponding list in the UI refreshes to reflect the latest state (no manual page refresh required)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister with all logic in backend/main.mo (no additional backend services).",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui."
  ],
  "nonGoals": [
    "Adding third-party authentication providers (only Internet Identity is supported).",
    "Implementing real-time collaboration or multi-user concurrent editing.",
    "Introducing external databases or off-chain storage beyond the existing blob storage mixin."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}