{
  "kind": "build_request",
  "title": "Make publishing workflow clear and add an obvious Publish callout in the editor UI",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-14",
      "text": "Add a prominent, always-visible \"Publishing\" callout section near the top of the Edit Content page that clearly explains the difference between saving edits (draft) and publishing the live site (chat-level publish), using clear English text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-9"
        ],
        "quotes": [
          "yess run the build again without changing anything and make the publish button appear clearly"
        ]
      },
      "acceptanceCriteria": [
        "On /edit, a clearly styled callout appears above the tabs (near the existing DraftReviewSummary) with a heading like \"Publishing\" or \"How to Publish\".",
        "The callout text explicitly states that edits are saved as draft in the editor and that publishing happens outside the editor (via the platform publish action in chat).",
        "The callout uses high-contrast styling consistent with the romantic theme (e.g., bordered card, icon, clear hierarchy) and is readable on mobile and desktop.",
        "No existing saved content is modified by merely viewing this callout (pure UI change)."
      ]
    },
    {
      "id": "REQ-15",
      "text": "In the Publishing callout, include a clear user action that helps users reliably trigger the correct publish flow when the chat-level Publish button fails to appear, without changing any site content.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-7",
          "msg-recent-9"
        ],
        "quotes": [
          "there is no button below your text",
          "make the publish button appear clearly"
        ]
      },
      "acceptanceCriteria": [
        "The callout includes a single primary CTA (e.g., \"Copy publish request message\") that copies a short, explicit message to the clipboard instructing the user what to send in chat to request a rebuild/resurface of the publish button (English text).",
        "After clicking the CTA, the UI shows a success confirmation (toast or inline confirmation) that the message was copied.",
        "The CTA does not perform any backend mutations and does not create/update/delete/reorder any gallery/messages/timeline/dedication/surprise content.",
        "If clipboard access is unavailable, the UI shows the message in a selectable text area so the user can manually copy it."
      ]
    }
  ],
  "constraints": [
    "Do not change or delete any user content as part of this work; the change must be UI-only and non-destructive.",
    "Do not modify any files under frontend/src/components/ui (compose existing UI components instead).",
    "Keep the existing routing structure (no route changes required)."
  ],
  "nonGoals": [
    "Implementing or modifying the platform/chat system that renders the real chat-level Publish button.",
    "Adding a true in-app publish mechanism that deploys the site (not possible from within the app itself)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}