{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Clarify publishing workflow and add prominent Publish callout on Edit Content page",
  "requirements": [
    {
      "id": "REQ-14",
      "summary": "Add a prominent, always-visible Publishing callout near the top of the Edit Content page explaining draft saves vs chat-level publishing.",
      "acceptanceCriteria": [
        "On /edit, a clearly styled callout appears above the tabs (near the existing DraftReviewSummary) with a heading like \"Publishing\" or \"How to Publish\".",
        "The callout text explicitly states that edits are saved as draft in the editor and that publishing happens outside the editor (via the platform publish action in chat).",
        "The callout uses high-contrast styling consistent with the romantic theme (e.g., bordered card, icon, clear hierarchy) and is readable on mobile and desktop.",
        "No existing saved content is modified by merely viewing this callout (pure UI change)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PublishingCallout.tsx",
          "operation": "create",
          "description": "Create a reusable, high-contrast romantic-themed callout card component with an icon, \"Publishing\" heading, and clear English copy describing: editor saves create drafts; publishing happens outside the editor via the chat-level/platform publish action. Ensure the component is purely presentational (no content mutations)."
        },
        {
          "path": "frontend/src/pages/EditContentPage.tsx",
          "operation": "modify",
          "description": "Wire the new PublishingCallout into /edit so it renders above the Tabs (positioned near DraftReviewSummary) and remains visually prominent on both mobile and desktop, without changing routing."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Add a single primary CTA in the Publishing callout to help users resurface the chat-level publish flow by copying a publish-request message with robust clipboard fallback and confirmation.",
      "acceptanceCriteria": [
        "The callout includes a single primary CTA (e.g., \"Copy publish request message\") that copies a short, explicit message to the clipboard instructing the user what to send in chat to request a rebuild/resurface of the publish button (English text).",
        "After clicking the CTA, the UI shows a success confirmation (toast or inline confirmation) that the message was copied.",
        "The CTA does not perform any backend mutations and does not create/update/delete/reorder any gallery/messages/timeline/dedication/surprise content.",
        "If clipboard access is unavailable, the UI shows the message in a selectable text area so the user can manually copy it."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PublishingCallout.tsx",
          "operation": "modify",
          "description": "Implement the CTA behavior: attempt to copy a predefined publish-request message via browser clipboard APIs; show an inline success confirmation when copied; if clipboard is unavailable/denied, reveal the same message in a read-only, selectable textarea for manual copy. Ensure no backend calls/mutations occur from this action."
        }
      ]
    }
  ]
}