{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "In-app Go Live guidance and version-specific publishing status UI",
  "requirements": [
    {
      "id": "REQ-5",
      "summary": "Add an in-editor “Go Live” guidance checklist that explains publishing and sharing the version-specific link for the active version.",
      "acceptanceCriteria": [
        "On the Edit page, users can see a short step-by-step checklist describing how to make the site live for the currently selected version.",
        "The guidance uses English user-facing text and explicitly mentions that publishing is required before visitors can see updates.",
        "The guidance references and matches the existing version-specific share link behavior (URL includes ?v=<version>)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/GoLiveGuidance.tsx",
          "operation": "create",
          "description": "Create a dedicated Go Live guidance component that renders an in-app, English step-by-step checklist for the active content version, including displaying (and referencing) the version-specific share link using the existing buildShareUrl behavior (?v=<version>)."
        },
        {
          "path": "frontend/src/pages/EditContentPage.tsx",
          "operation": "modify",
          "description": "Wire the new GoLiveGuidance section into the /edit experience (near existing PublishingCallout/PublishControls) so the checklist is always visible within the editor for the currently selected version."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Make publish/share UI clearly reflect whether the active version is live and provide a persistent one-click copy of the correct version share link.",
      "acceptanceCriteria": [
        "When viewing /edit, the user can always find the share link for the active version (not only immediately after a successful publish).",
        "The UI clearly indicates whether the active version is currently published (live) or not.",
        "Copying the link copies a URL in the form `${origin}/?v=${activeVersion}` (using the existing `buildShareUrl`)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the publish-status query to be version-scoped by using activeVersion in the query key and by calling the backend capability with the active version argument, so the UI can accurately display live/not-live for the currently selected version."
        },
        {
          "path": "frontend/src/components/ContentVersionSwitcher.tsx",
          "operation": "modify",
          "description": "Ensure version switching also invalidates/refetches the version-scoped publishStatus query for both the previous and newly selected versions, keeping the “Live/Not published yet” indicator accurate after switching."
        },
        {
          "path": "frontend/src/components/PublishControls.tsx",
          "operation": "modify",
          "description": "Revise the publishing UI to (1) show a prominent status indicator for the active version based on version-scoped publishStatus (e.g., “Live” vs “Not published yet”) and (2) provide a persistent share link area with a one-click Copy action that always copies the correct buildShareUrl(activeVersion), independent of any success toast/alert visibility."
        },
        {
          "path": "frontend/src/utils/urlParams.ts",
          "operation": "modify",
          "description": "Ensure the existing share-link behavior is centralized in a buildShareUrl(activeVersion) utility that returns a URL in the form `${origin}/?v=${activeVersion}`, and that PublishControls/GoLiveGuidance use this function for copying/displaying the share link."
        }
      ]
    }
  ]
}